[1,["cdztdmYzxMh4KiFY96S5M3","1cv3JlqgNFB6KiXrs/Hkwp@f9941","dbPlMA4DpEcJVrVdprdQPq","29qyk/2llGPbKOmxliuJIO@f9941","2fqfr4oR1Mx7Nt8Ba7zki+@f9941"],["node","_font","_spriteFrame","_normalSprite","root","_target","data","_parent","_scrollView"],[["cc.Node",["_name","_layer","_active","_components","_prefab","_parent","_lpos","_children","_lscale"],0,9,4,1,5,2,5],["cc.Widget",["_alignFlags","_originalWidth","_originalHeight","_bottom","_alignMode","_top","node","__prefab"],-3,1,4],["cc.Node",["_name","_layer","_active","_parent","_components","_prefab","_lpos","_children"],0,1,12,4,5,2],["cc.UITransform",["node","__prefab","_contentSize","_anchorPoint"],3,1,4,5,5],["cc.Sprite",["_sizeMode","_isTrimmedMode","_type","node","__prefab","_spriteFrame"],0,1,4,6],["cc.Label",["_actualFontSize","_fontSize","_lineHeight","_isSystemFontUsed","_cacheMode","_enableWrapText","_string","_horizontalAlign","_verticalAlign","_overflow","node","__prefab","_font"],-7,1,4,6],["cc.Prefab",["_name"],2],["cc.CompPrefabInfo",["fileId"],2],["cc.Button",["_transition","_zoomScale","node","__prefab","_normalColor","_target","_normalSprite"],1,1,4,5,1,6],["cc.PrefabInfo",["fileId","instance","targetOverrides","nestedPrefabInstanceRoots","root","asset"],-1,1,1],["cc.ScrollBar",["_direction","node","__prefab","_handle"],2,1,4,1],["cc.ScrollView",["bounceDuration","brake","horizontal","node","__prefab","_content","_verticalScrollBar"],0,1,4,1,1],["cc.Mask",["node","__prefab"],3,1,4],["cc.Graphics",["node","__prefab","_fillColor"],3,1,4,5],["cc.Layout",["_resizeMode","_layoutType","_paddingTop","_paddingBottom","node","__prefab"],-1,1,4],["cc.BlockInputEvents",["node","__prefab"],3,1,4],["cc.UIOpacity",["node","__prefab"],3,1,4]],[[7,0,2],[9,0,1,2,3,4,5,5],[3,0,1,2,3,1],[3,0,1,2,1],[0,0,2,1,5,3,4,6,4],[5,6,7,8,0,1,2,9,3,4,10,11,12,10],[4,0,1,3,4,5,3],[4,2,0,3,4,3],[1,0,1,2,6,7,4],[0,0,1,5,7,3,4,3],[15,0,1,1],[16,0,1,1],[6,0,2],[0,0,1,7,3,4,3],[0,0,1,5,7,3,4,6,3],[0,0,1,5,3,4,6,3],[0,0,1,5,3,4,6,8,3],[0,0,1,7,3,4,6,3],[2,0,1,3,7,4,5,6,3],[2,0,2,1,3,7,4,5,6,4],[2,0,1,3,4,5,6,3],[3,0,1,1],[8,0,1,2,3,4,5,6,3],[5,0,1,2,5,3,4,10,11,12,7],[1,0,1,6,7,3],[1,0,2,4,6,7,4],[1,0,3,1,2,6,7,5],[1,0,5,3,1,2,6,7,6],[10,0,1,2,3,2],[11,0,1,2,3,4,5,6,4],[12,0,1,1],[13,0,1,2,1],[14,0,1,2,3,4,5,5]],[[12,"PnlPrivate"],[13,"PnlPrivate",33554432,[-6],[[3,-2,[0,"a7zu8p2GFMJbY7ZmRLwQCo"],[5,750,1624]],[8,45,100,100,-3,[0,"bcGsy43HFFJ4yE6XE+qa1A"]],[10,-4,[0,"c9IkCGlYROSo05UjbJyL06"]],[11,-5,[0,"04dK9jidNEFrY0BxqO8YrU"]]],[1,"852LgcK19E04pHcG/IsOoO",null,null,null,-1,0]],[17,"content",33554432,[-10,-11,-12,-13,-14],[[2,-7,[0,"90m/dLy8ZH96BHJq/tBAIf"],[5,750,96],[0,0.5,1]],[26,45,1198,220,400,-8,[0,"79MplP5nZA5ryT2NlFlSV4"]],[32,1,2,48,48,-9,[0,"6e880MZyVGdqdkOh6Zxm5+"]]],[1,"06kId1P71L47y9vOqKSwjY",null,null,null,1,0],[1,0,647,0]],[9,"Nego_private",33554432,1,[-20,-21],[[3,-15,[0,"58DGKkQgZBoI/jXYojFx8W"],[5,750,1624]],[8,45,750,1395,-16,[0,"5cPRgzodVNOYuYDia6aFyH"]],[10,-17,[0,"7cLQs7Bo9BP4GNpLwF67t0"]],[11,-18,[0,"87YIVHYchHJ6Qe1n/Ztj+Y"]],[6,0,false,-19,[0,"9dNnblthZGgbYwV8E1suwg"],9]],[1,"58xYD35jdCrIOu4BWI12Qq",null,null,null,1,0]],[18,"ScrollView",33554432,3,[-26,-27],[[[3,-22,[0,"a1SbMXbyBJfYIC9dmPaYhS"],[5,750,1294]],[7,1,0,-23,[0,"c1ce4EpL1MEoViFDzefwpO"]],-24,[27,45,200,130,240,250,-25,[0,"93CG5gUg9PsZUJg+XTHrnN"]]],4,4,1,4],[1,"0algkz9uVGX7EiiCnVhU8j",null,null,null,1,0],[1,0,-35,0]],[14,"Sprite",33554432,3,[-31,-32],[[3,-28,[0,"a0Ht8ioQxMb5rFeF55++Ab"],[5,750,200]],[6,0,false,-29,[0,"bc55FUnxdEO4EM2GVpBWot"],3],[24,41,750,-30,[0,"47fLFp4PBA05DdMG47uiLx"]]],[1,"11zqxjjQlN+pJStZ+TfELM",null,null,null,1,0],[1,0,712,0]],[19,"scrollBar",false,33554432,4,[-37],[[[2,-33,[0,"c80kWo4GVD5p+LsclSK/VO"],[5,12,1294],[0,1,0.5]],[7,1,0,-34,[0,"97WMXznvxH9pqoLqpE7Orz"]],[25,37,250,1,-35,[0,"81VXuwCmhPE4nN1XG5V4lG"]],-36],4,4,4,1],[1,"f99F2salxNF5R7Y91hMw/U",null,null,null,1,0],[1,375,0,0]],[9,"view",33554432,4,[2],[[3,-38,[0,"99UvE6SJRBIZldbWUyjEV+"],[5,750,1294]],[30,-39,[0,"42iCeqRhFOp6CpTrOAORxq"]],[31,-40,[0,"cdXA/xkvBE/olI2t//elnB"],[4,16777215]],[8,45,240,250,-41,[0,"b8NVWdSElHCZMse7p5JIDb"]]],[1,"e1SKnIfLlMYqLqCu+ELy/D",null,null,null,1,0]],[15,"Btn_closePrivate",33554432,5,[[21,-42,[0,"0fQN3cSspFkJuNd8WsMvuT"]],[6,2,false,-43,[0,"29thRX2CRBvJhTWvdLgcvL"],0],[22,3,0.95,-45,[0,"ceVGkNiWNCXaqydUTYmg7j"],[4,4292269782],-44,1]],[1,"c8wka2EFpNK6uVHZju41hN",null,null,null,1,0],[1,-320,-44,0]],[16,"TextC_privateTitle",33554432,5,[[3,-46,[0,"ab225phgJEbKBr65Xeg+MC"],[5,137.69,80.64]],[23,64,64,64,false,false,1,-47,[0,"29zLgsSMJDiooWxax+CBhz"],2]],[1,"90VJWoua5G+aowbCr1angi",null,null,null,1,0],[1,0,-42,0],[1,0.5,0.5,1]],[20,"bar",33554432,6,[[[2,-48,[0,"05zbqwpw5GWKWj4/HezQce"],[5,10,156.25],[0,0,0]],-49],4,1],[1,"a5fkSNlJ9G4q2TyS58OQZz",null,null,null,1,0],[1,-11,-31.25,0]],[4,"TextC_user1",false,33554432,2,[[2,-50,[0,"fdoWivF3RI4qwskNSBGB4I"],[5,655,1777.8],[0,0.5,1]],[5,"TERMS AND CONDITIONS\nThese terms and conditions create a contract between you (\"the user\" or \"the player\") and VG CO., LIMITED (hereinafter referred to as \"VG\" or \"we\" or \"us\" or \"our\"). Please read the Agreement carefully to confirm your understanding and acceptance of the Agreement.\n\nINTRODUCTION TO OUR SERVICES\nThis Agreement governs your use of VG's services (\"Services\"), through which you can buy, get, license, rent, or subscribe to content, apps (\"Apps\"), and other in-app services (collectively, \"Content\"). Content may be offered through the Services by VG or a third party. Our Services are available for your use in your country of residence (\"Home Country\"). To use our Services, you need compatible hardware, software (latest version recommended and sometimes required), and Internet access (fees may apply). Our Services' performance may be affected by these factors.\n\nPAYMENTS, TAXES, AND REFUNDS\nYou can acquire Content on our Services for free or for a charge, either of which is referred to as a \"Transaction.\" Each Transaction is an electronic contract between you and VG, and/or you and the entity providing the Content on our Services. When you make your first Transaction, we will ask you to choose how frequently we should ask for your password for future Transactions. All Transactions are final. Content prices may change at any time. If technical problems prevent or unreasonably delay the delivery of Content, your exclusive and sole remedy is either replacement of the Content or a refund of the price paid, as determined by VG. From time to time, VG may refuse a refund request if we find evidence of fraud, refund abuse, or other manipulative behavior that entitles VG to a corresponding counterclaim.\n\nVG ID\nUsing our Services and accessing your Content may require a VG ID. A VG ID is the account you use across VG's ecosystem. Your VG ID is valuable, and you are responsible for maintaining its confidentiality and security. VG is not responsible for any losses arising from the unauthorized use of your VG ID. Please contact VG if you suspect that your VG ID has been compromised.\nYou must be age 18 (or the equivalent minimum age in your Home Country, as set forth in the registration process) to create a VG ID and use our Services. VG IDs for persons under this age can be created by a parent or legal guardian using Family Sharing or by an approved educational institution.\n\nPRIVACY POLICY & LEGALITY\nYour use of our Services is subject to VG's Privacy Policy & Legality, which is available at \nPRIVACY POLICY & LEGALITY.\nYour use of our Services is subject to VG's Privacy Policy & Legality, which is available at PRIVACY POLICY & LEGALITY.\n\nSERVICES AND CONTENT USAGE RULES\nYour use of the Services and Content must follow the rules set forth in this section (\"Usage Rules\"). Any other use of the Services and Content is a material breach of this Agreement. VG may monitor your use of the Services and Content to ensure that you are following these Usage Rules.",0,0,22,22,30,3,false,1,-51,[0,"9dFabP5H9EdKnBvFyQvcgJ"],4]],[1,"f04bAN4wlCHK2LrYjsKts6",null,null,null,1,0],[1,0,-48,0]],[4,"TextC_user2",false,33554432,2,[[2,-52,[0,"8aHCY5RHNIhaaX+B6kpADz"],[5,655,907.8000000000001],[0,0.5,1]],[5,"USE OF SERVICE RESTRICTIONS\n1.You must not use the Service if you are under the age of 18. You must deny anyone under 18 from using your account. You are fully responsible for any unauthorized use of the Service, including but not limited to the use of a credit card or any payment by any method.\n2.You shall use your account only for non-commercial entertainment purposes. You shall not use the Service for any other purpose.\n3.You shall not use your account for any illegal activity.\n4.You shall not use your account to transmit repetitive messages (spam), junk email, advertise, or solicit.\n5.You shall not post any objectionable and offensive information, including but not limited to abusive, threatening, racial, sexual, or obscene content.\n6.You will not use your account to cheat or hack the game by any means.\n7.You shall not sublicense, lease, trade, gift, sell, or otherwise transfer your account or associated virtual items partly or fully to anyone without written permission from VG.\n8.You shall not buy or purchase chips and virtual items from any unauthorized source.\n9.You shall not create or use more than one Facebook account to use the Service.\n10.You shall not use any of the Services or create an account or use an account if you have been removed or banned from using the Service.\n11.You shall not use any of the VG services if you do not agree with the Terms of Service, Privacy Policy & Legality, or any other policy, and your license to use the services shall immediately terminate.",0,0,22,22,30,3,false,1,-53,[0,"86SXp/gaxBjK9PdwZLBj/N"],5]],[1,"84Q/BTXmhDKZQrTyhib5H4",null,null,null,1,0],[1,0,-1825.8,0]],[4,"TextC_privacy1",false,33554432,2,[[2,-54,[0,"b5oZewk1lAfLfsSEt5BjO/"],[5,655,2048],[0,0.5,1]],[5,"PRIVACY POLICY & LEGALITY\nThis Privacy Policy & Legality forms part of our TERMS AND CONDITIONS. By accepting the TERMS AND CONDITIONS and the PRIVACY POLICY & LEGALITY on the registration page, you consent to provide sensitive personal data or personal information and are aware of the purpose of sharing such information. Please do not register if you do not wish to share the mandatory personal information with VG. Registration procedure cannot be completed until information in the non-optional fields is provided. Certain additional personal information may be requested by VG for permitting you access to any Games organized by VG.\n\nPOLICY OBJECTIVE\nVG respects your privacy and assures you that any information provided by you to VG is protected and will be dealt with according to this Policy and the applicable laws. This Policy provides the procedure followed by VG to gather, use, store, disclose, and manage users' personal data. VG only collects personal data for the purpose of verifying user accounts, maintaining the accounts of the users, completing transactions of the users, and analyzing user behavior and requirements.\n\nWHAT IS INCLUDED IN PERSONAL DATA\nUser's personal data includes the following types of personal data or information:\nSensitive Personal Data: Account password, Financial information such as Bank account or credit card or debit card or other payment instrument details.\nOther Personal Information: Name, Date of birth, Telephone number, Postal/Contact address, PAN number (as applicable), The IP address of your computer, Browser type and language, The date and the time during which you accessed the site, The address of the website which you may have used to link to any Website, Your photograph for testimonials and other promotions. Such other information that is defined as sensitive personal data or information in law.\n\nUSER CONSENTS\nConsent for use of Sensitive Personal Data and Other Personal Information:\nAll users of VG consent to the use of Sensitive Personal Data and Other Personal Information for the purpose stated in this policy. We restrict access of personal information to our employees, contractors, and agents and only allow access to those who need to know that information in order to process it on our behalf.\nWithdrawal of consent of all or any part of Sensitive Personal Data and Other Personal Information may result in immediate withdrawal of any right to avail the services provided by VG. Withdrawal of consent shall not restrict the right of VG to use Other Personal Information for analysis of user data, subject to the condition that the Other Personal Information used in any analysis is not personally identifiable to any individual user.\n\nPhotographs once provided by you for marketing purposes give VG irrevocable rights to use it, and it is completely VG's discretion to delete or not use it any further.\n\nVG may also use software applications for website traffic analysis and to gather statistics, used for advertising and for determining the efficacy and popularity of VG among others.\n\nPresently, VG is using display advertising and remarketing through Google Analytics, wherein third-party vendors, including Google, display our ads on sites across the internet and use first-party cookies and third-party cookies together to inform, optimize, and serve ads based on visits of visitors to our website. Our visitors are free to opt out of Google Analytics for display advertising and customize Google Display Network ads using the Ads Preference Manager.",0,0,22,22,30,3,false,1,-55,[0,"aaWAQoz9pCl5I5SJLTtX6u"],6]],[1,"69UfN3+ZpNSZOYA9gj8k6d",null,null,null,1,0],[1,0,-48,0]],[4,"TextC_privacy2",false,33554432,2,[[2,-56,[0,"cfWWZj1EBJTJWh6sHaxLn/"],[5,655,1747.8],[0,0.5,1]],[5,"CONSENT TO USE OF COOKIES\nWhat is a Cookie: A cookie is a small text file that uniquely identifies your browser.\nYou understand that when you visit the Website, cookies may be left in your computer. The cookies assigned by the servers of VG may be used to personalize your experience on the Website. Additionally, cookies may also be used for authentication, game management, data analysis, and security purposes.\nCookies may also be assigned by the advertisers of VG when you click on any of the advertisements which may be displayed on any Website, in which case such cookies are controlled by these advertisers and not VG.\n\nCONSENT TO EMAIL COMMUNICATION\nWhen you register your email address with VG, you agree to receive email communication from VG, entities specifically authorized by VG, and other users. You also agree and acknowledge that when you use our referral program for referring someone, VG will send emails to such a person referred by you on your behalf, and the email headers will carry your email address as the address from which such emails are sent.\n\nVG may also access and store such information relating to your contacts to send invitations and other promotions to them periodically.\n\nDATA SECURITY\nWe take appropriate security measures to protect against unauthorized access to or unauthorized alteration, disclosure, or destruction of data. These include internal reviews of our data collection, storage, and processing practices and security measures, including appropriate encryption and physical security measures to guard against unauthorized access to systems where we store personal data. VG has a comprehensive information security program and information security policies which contain managerial, technical, operational, and physical security control measures adopted by VG for the protection of Sensitive Personal Data and Other Personal Information.\n\nInformation gathered by VG is stored securely using several information security applications, including firewalls. However, security is always relative, and VG cannot guarantee that its security measures are absolute and cannot be breached. Data transmitted over the Internet is inherently exposed to security risks or threats. For instance, information transmitted via chat or email can be compromised and used by others. Therefore, VG cannot guarantee any security for such information in the course of transmission through the internet infrastructure or any unsolicited disclosures made by any user availing the services of the Website.\nWhen you register with VG, your account is protected by means of login information, which includes a username and a password that is known only to you. Therefore, you should not provide your login information to anyone whatsoever, and breach hereof constitutes a violation of this Policy and can also result in closure of the account in certain cases. If you become aware of or reasonably suspect any breach of security, including compromise of your login information, it is your responsibility to immediately notify VG.\n",0,0,22,22,30,3,false,1,-57,[0,"faw2nG/vREJomL8oPvW/Gk"],7]],[1,"2722a9RyJG4LGQwKBiOLll",null,null,null,1,0],[1,0,-48,0]],[4,"TextC_privacy3",false,33554432,2,[[2,-58,[0,"2eQae7mjpJlL9qHN4wPGH6"],[5,655,1417.8],[0,0.5,1]],[5,"The Websites may contain links to other websites. Such websites are governed by their own privacy policies and legality, and VG does not exercise any control over them. It is your responsibility to read and understand the Privacy Policy and Legality of such websites when you follow a link outside the Website. You are advised to exercise caution in sharing any personal information with any third party that advertises on the Websites, and VG shall not be responsible for such information provided by you on third-party websites.\n\nVG has a policy of not sharing any personally identifiable information with anyone other than entities specifically authorized by VG, which may include advertisers and sponsors of VG. However, VG may use your name, photo, Login ID, and the state from where you are participating when announcing the results of any contests run on the Website. Such contests are further governed by Terms and Conditions, which shall be available on the Websites as and when such a contest is run on any Website. VG reserves the right to share your registration information with VG-appointed market research and advertising companies or firms from time to time for the said purposes. VG may also use cumulative non-personal information for auditing and analysis purposes with the aim of improving its services.\n\nEXCLUSIONS\nVG may share Sensitive Personal Data and Other Personal Information if sharing of such information is necessary: to comply with legal processes or governmental requests, to enforce the Terms and Conditions and this Privacy Policy & Legality, for prevention of fraud, for issues involving information security, to protect your rights, rights of VG, and rights of the general public.\n\nLIMITATION OF LIABILITY\nVG confirms that this Privacy Policy & Legality is only a description of its operation regarding user information. This Policy is not intended to and does not create any legal rights in your favor or in the favor of any other person. VG reserves the right to change this Policy at any time without giving you prior notice. The liability of VG shall be limited to the removal of Sensitive Personal Data from the system of the Websites and removal of personally identifiable elements of the Other Personal Information. Notwithstanding anything to the contrary contained in this Policy and elsewhere, the a VGregate liability of VG for all claims for damages pursuant to provisions of services on the Website, including claims in respect to the violation of this Policy, shall be limited to the a VGregate maximum amount of liability as provided in the Terms and Conditions.",0,0,22,22,30,3,false,1,-59,[0,"df+vtOz+BAAKwN3zOvNIxD"],8]],[1,"05AdXKPRRKZZOK+soN8fg0",null,null,null,1,0],[1,0,-48,0]],[7,1,0,10,[0,"02Vf56XMlLBrTrDI4kn8I2"]],[28,1,6,[0,"5dTWUmZOFKTKxewLSDN0ya"],16],[29,0.23,0.75,false,4,[0,"703zo/+s5NQZbGiMrpjF8P"],2,17]],0,[0,4,1,0,0,1,0,0,1,0,0,1,0,0,1,0,-1,3,0,0,2,0,0,2,0,0,2,0,-1,11,0,-2,12,0,-3,13,0,-4,14,0,-5,15,0,0,3,0,0,3,0,0,3,0,0,3,0,0,3,0,-1,5,0,-2,4,0,0,4,0,0,4,0,-3,18,0,0,4,0,-1,6,0,-2,7,0,0,5,0,0,5,0,0,5,0,-1,8,0,-2,9,0,0,6,0,0,6,0,0,6,0,-4,17,0,-1,10,0,0,7,0,0,7,0,0,7,0,0,7,0,0,8,0,0,8,0,5,8,0,0,8,0,0,9,0,0,9,0,0,10,0,-2,16,0,0,11,0,0,11,0,0,12,0,0,12,0,0,13,0,0,13,0,0,14,0,0,14,0,0,15,0,0,15,0,6,1,2,7,7,17,8,18,59],[0,0,0,0,0,0,0,0,0,0],[2,3,1,2,1,1,1,1,1,2],[1,1,2,3,0,0,0,0,0,4]]