{"message":"cn","header":{"nav_cfg":{"Menu_1":"HOME","Menu_2":"DOWNLOAD","Menu_3":"ABOUT US","Menu_4":"MAKE POKER FULL OF VITALITY","Menu_5":"Make Poker Full of Vitality"}},"homePage":{"Homepage_1":"Android","Homepage_2":"Telegram","Homepage_3":"Welcome to VG Poker","Homepage_4":"Still looking for a trustworthy poker platform? Join VGPoker now and enjoy our unique features.","Homepage_5":"Fast Deposits and Withdrawals","Homepage_6":"Various payment methods with fast, secure, and convenient transactions","Homepage_7":"Invitation & Agent System","Homepage_8":"Invite friends to get rewards Promote to earn money and continue receiving commissions","Homepage_9":"Tournament","Homepage_10":"High-Stakes Tournaments & Welfare Tournaments","Homepage_11":"Cashback & VGcare","Homepage_12":"High Rebate Loss Compensation ","Homepage_13":"VIP System","Homepage_14":"Exclusive benefits for VIP","Homepage_15":"Multiple deals & EV cashout","Homepage_16":"Multiple ways to protect your pot equity","Homepage_17":"Various Ways to Play","Homepage_18":"Cash Game & Tournaments","Homepage_19":"You can play poker online with the best of players at any hour of the day. We bring together a multiplayer game environment that lets you pick the best of tournaments along with the poker game of your choice combined with safe and secure gameplay","Homepage_20":"Unique Features","Homepage_21":"Enjoy the fun and win cash","Homepage_22":"Follow us","Homepage_23":"Be part of global community","Homepage_24":"VGPoker_en","Homepage_25":"Coming soon","Homepage_26":"Experience Now"},"aboutPage":{"Aboutus_1":"ABOUT VG.POKER","Aboutus_2":"A MORE PROFESSIONAL AND LARGER-SCALE ONLINE POKER PLATFORM","Aboutus_3":"VG.Poker was launched in 2022 and has since been providing a stable and excellent gaming environment for poker enthusiasts.","Aboutus_4":"registered users","Aboutus_5":"online players","Aboutus_6":"games per day"},"downloadPage":{"Download_1":"VG.POKER DOWNLOADS","Download_2":"SELECT A PLATFORM TO DOWNLOAD THE APPLICATION","Download_3":"Android","Download_4":"Telegram","Download_5":"Download & Install","Download_6":"Select a platform to download the application. After the VG.Poker app is downloaded to your device, open the file (it maybe saved to your Download folder), select 'Install' to continue. lf a security warning flashes up, select Yes' or Run'. To launch the VG.Poker app, just select the app icon once it has finished installing.","Download_7":"Create Your Free Account","Download_8":"It is totally free to become a VG.Poker player. Open the app and select 'Google' or 'Account' to sign up with your Google account or your mobile number. You can also directly enter the game as a guest to experience our game. Choose your preferred login method to enter the game and get ready to access the thrilling world of online poker at VG.Poker.","Download_9":"Start Playing Now","Download_10":"Before getting stuck into the action, you can claim our free bonus. And then you may want to select 'Cashier' to see the range of payment options available to you. Simply use the tabs or icons to find your preferred poker games – we’ve made things as clear as we could!"}}