{"message":"cn","header":{"nav_cfg":{"Menu_1":"INICIAL","Menu_2":"DOWNLOAD","Menu_3":"SOBRE NÓS","Menu_4":"DÊ VIDA AO PÔQUER","Menu_5":"Dê Vida Ao Pôquer"}},"homePage":{"Homepage_1":"Android","Homepage_2":"Telegram","Homepage_3":"Bem-vindo ao VG Poker","Homepage_4":"Ainda procurando uma plataforma de poker confiável? Junte-se à VGPoker e aproveite nossos recursos exclusivos.","Homepage_5":"Depósito e Retirada Rápidos","Homepage_6":"Vários métodos de pagamento, com transações rápidas, seguras e convenientes","Homepage_7":"Sistema de Convite & Agente","Homepage_8":"Convide amigos para obter recompensas Promova para ganhar dinheiro e continue recebendo comissões ","Homepage_9":"Torneio","Homepage_10":"Torneios de Alto Valor & Torneios de Benefícios","Homepage_11":"Cashback & VGcare","Homepage_12":"Reembolso alto Compensação por perdas ","Homepage_13":"Sistema VIP","Homepage_14":"Benefícios exclusivos para VIP","Homepage_15":"Múltiplas divisões & EV Cashout","Homepage_16":"Diversas maneiras de proteger sua equidade no pote","Homepage_17":"Várias Formas de Jogar","Homepage_18":"Mesa de Dinheiro & Torneios","Homepage_19":"Você pode jogar pôquer online com os melhores jogadores a qualquer hora do dia. Oferecemos um ambiente de jogo multijogador que permite escolher os melhores torneios, além do jogo de pôquer de sua preferência, combinado com jogabilidade segura e confiável.","Homepage_20":"Recursos Únicos","Homepage_21":"Desfrute da diversão e ganhe dinheiro","Homepage_22":"Siga-nos","Homepage_23":"Faça parte de uma comunidade global","Homepage_24":"VGPoker_en","Homepage_25":"Em breve","Homepage_26":"Experimente Agora"},"aboutPage":{"Aboutus_1":"SOBRE O VG.POKER","Aboutus_2":"A PLATAFORMA DE PÔQUER ONLINE MAIS PROFISSIONAL E DE MAIOR ESCALA","Aboutus_3":"VG.Poker foi lançada em 2022, e desde então tem proporcionado um ambiente de jogo estável e excelente para os entusiastas do pôquer.","Aboutus_4":"Usuários registrados","Aboutus_5":"Jogadores on-line","Aboutus_6":"Jogos por dia"},"downloadPage":{"Download_1":"DOWNLOADS DO VG.POKER","Download_2":"SELECIONE UMA PLATAFORMA PARA BAIXAR O APLICATIVO","Download_3":"Android","Download_4":"Telegram","Download_5":"Download & Instalar","Download_6":"Selecione uma plataforma para baixar o aplicativo. Após o download do aplicativo VG.Poker em seu dispositivo, abra o arquivo (pode estar salvo na pasta de Downloads), selecione 'Instalar' para continuar. Se um aviso de segurança aparecer, selecione 'Sim' ou 'Executar'. Para iniciar o aplicativo VG.Poker, basta selecionar o ícone do aplicativo após a conclusão da instalação.","Download_7":"Crie Sua Conta Gratuita","Download_8":"Tornar-se um jogador VG.Poker é totalmente gratuito. Abra o aplicativo e selecione 'Google' ou 'Conta' para se inscrever com sua conta do Google ou seu número de celular. Você também pode entrar diretamente como convidado para experimentar nosso jogo. Escolha seu método de login preferido para entrar no jogo e esteja pronto para acessar o emocionante mundo do pôquer online no VG.Poker.","Download_9":"Comece a Jogar Agora","Download_10":"Antes de mergulhar na ação, você pode reivindicar nosso bônus gratuito. Em seguida, você pode querer selecionar 'Caixa' para ver as opções de pagamento disponíveis para você. Basta usar as abas ou ícones para encontrar seus jogos de pôquer preferidos - nós tornamos as coisas o mais claras possível!"}}